balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F3014E.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="30xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="DSPIC30F3014E" edc:procid="0xd" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="13.000" edc:maxvoltage="13.250" edc:minvoltage="9.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="4.500" edc:minvoltage="2.500" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:lvpthresh="4.500" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="2000" edc:eedata="2000" edc:erase="10000" edc:lverase="2000" edc:lvpgm="2000" edc:pgm="2000" edc:userid="2000"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="30xxxx" edc:name="30xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:WatchdogTimer edc:min="2"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="4"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="7"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="8"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="9"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="10"/>
    <edc:Interrupt edc:cname="ADCInterrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="11"/>
    <edc:Interrupt edc:cname="NVMInterrupt" edc:desc="NVM Write Complete Interrupt" edc:irq="12"/>
    <edc:Interrupt edc:cname="SI2CInterrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="13"/>
    <edc:Interrupt edc:cname="MI2CInterrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="14"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="15"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="16"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="IC7 - Input Capture 7" edc:irq="17"/>
    <edc:Interrupt edc:cname="IC8Interrupt" edc:desc="IC8 - Input Capture 8" edc:irq="18"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="OC3 - Output Compare 3" edc:irq="19"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="OC4 - Output Compare 4" edc:irq="20"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="21"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="22"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="23"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="U2RX - UART2 Receiver" edc:irq="24"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="U2TX - UART2 Transmitter" edc:irq="25"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 - SPI2 Transfer Done" edc:irq="26"/>
    <edc:Interrupt edc:cname="C1Interrupt" edc:desc="C1 - ECAN1 Event" edc:irq="27"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="IC3 - Input Capture 3" edc:irq="28"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="IC4 - Input Capture 4" edc:irq="29"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="IC5 - Input Capture 5" edc:irq="30"/>
    <edc:Interrupt edc:cname="IC6Interrupt" edc:desc="IC5 - Input Capture 6" edc:irq="31"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="OC5 - Output Compare 5" edc:irq="32"/>
    <edc:Interrupt edc:cname="OC6Interrupt" edc:desc="OC6 - Output Compare 6" edc:irq="33"/>
    <edc:Interrupt edc:cname="OC7Interrupt" edc:desc="OC7 - Output Compare 7" edc:irq="34"/>
    <edc:Interrupt edc:cname="OC8Interrupt" edc:desc="OC8 - Output Compare 8" edc:irq="35"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="INT3 - External Interrupt 3" edc:irq="36"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="INT4 - External Interrupt 4" edc:irq="37"/>
    <edc:Interrupt edc:cname="C2Interrupt" edc:desc="C2 - ECAN2 Event" edc:irq="38"/>
    <edc:Interrupt edc:cname="PWMInterrupt" edc:desc="PWM - PWM Period Match" edc:irq="39"/>
    <edc:Interrupt edc:cname="QEIInterrupt" edc:desc="QEI - Position Counter Compare" edc:irq="40"/>
    <edc:Interrupt edc:cname="DCIInterrupt" edc:desc="DCI - Interrupt" edc:irq="41"/>
    <edc:Interrupt edc:cname="LVDInterrupt" edc:desc="LVD - Interrupt" edc:irq="42"/>
    <edc:Interrupt edc:cname="FLTAInterrupt" edc:desc="FLTA - MCPWM Fault A" edc:irq="43"/>
    <edc:Interrupt edc:cname="FLTBInterrupt" edc:desc="FLTB - MCPWM Fault B" edc:irq="44"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="0x1" edc:idbyte="r"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x80" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x80" edc:endaddr="0x84" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x84" edc:endaddr="0x100" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x4000" edc:regionid="program"/>
    <edc:EEDataSector edc:beginaddr="0x7ffc00" edc:endaddr="0x800000" edc:regionid="eedata"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x800600" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x8005c0" edc:endaddr="0x800600" edc:regionid="userid"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf8000e" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="nn---nnn---nnnnn" edc:cname="FOSC" edc:default="0xf9e0" edc:desc="" edc:impl="0xc71f" edc:name="FOSC" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc71f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSFPR" edc:desc="Oscillator" edc:mask="0x71f" edc:name="FOSFPR" edc:nzwidth="0xb">
              <edc:DCRFieldSemantic edc:cname="ECIO_PLL4" edc:desc="ECIO w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x70d">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO_PLL8" edc:desc="ECIO w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x70e">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO_PLL16" edc:desc="ECIO w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x70f">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_PLL4" edc:desc="FRC w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x701">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_PLL8" edc:desc="FRC w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x70a">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_PLL16" edc:desc="FRC w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x703">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT_PLL4" edc:desc="XT w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x705">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT_PLL8" edc:desc="XT w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x706">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT_PLL16" edc:desc="XT w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x707">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS2_PLL4" edc:desc="HS2 w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x711">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS2_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS2_PLL8" edc:desc="HS2 w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x712">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS2_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS2_PLL16" edc:desc="HS2 w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x713">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS2_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS3_PLL4" edc:desc="HS3 w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x715">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS3_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS3_PLL8" edc:desc="HS3 w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x716">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS3_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS3_PLL16" edc:desc="HS3 w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x717">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS3_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO" edc:desc="ECIO" edc:when="(field &amp; 0x71f) == 0x30c">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT" edc:when="(field &amp; 0x71f) == 0x304">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS" edc:when="(field &amp; 0x71f) == 0x302">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC" edc:when="(field &amp; 0x71f) == 0x30b">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="EC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ERC" edc:desc="ERC" edc:when="(field &amp; 0x71f) == 0x309">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ERC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ERCIO" edc:desc="ERCIO" edc:when="(field &amp; 0x71f) == 0x308">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ERCIO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XTL" edc:desc="XTL" edc:when="(field &amp; 0x71f) == 0x300">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XTL"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="Low-Power 32KHz Osc (No change to Primary Osc Mode bits)" edc:when="(field &amp; 0x700) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="LP"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (No change to Primary Osc Mode bits)" edc:when="(field &amp; 0x700) == 0x100">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Internal Low-Power RC (No change to Primary Osc Mode bits)" edc:when="(field &amp; 0x700) == 0x200">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="LPRC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="FCKSMEN" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSMEN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSW_FSCM_OFF" edc:desc="Sw Disabled, Mon Disabled" edc:when="(field &amp; 0x2) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_FSCM_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="CSW_ON_FSCM_OFF" edc:desc="Sw Enabled, Mon Disabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_ON_FSCM_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="CSW_FSCM_ON" edc:desc="Sw Enabled, Mon Enabled" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_FSCM_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n---------nnnnnn" edc:cname="FWDT" edc:default="0xffff" edc:desc="" edc:impl="0x803f" edc:name="FWDT" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x803f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FWPSB" edc:desc="WDT Prescaler B" edc:mask="0xf" edc:name="FWPSB" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="WDTPSB_1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_1"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_2"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_3" edc:desc="1:3" edc:when="(field &amp; 0xf) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_3"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_5" edc:desc="1:5" edc:when="(field &amp; 0xf) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_5"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_6" edc:desc="1:6" edc:when="(field &amp; 0xf) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_6"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_7" edc:desc="1:7" edc:when="(field &amp; 0xf) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_7"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_9" edc:desc="1:9" edc:when="(field &amp; 0xf) == 0x8">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_9"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_10" edc:desc="1:10" edc:when="(field &amp; 0xf) == 0x9">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_10"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_11" edc:desc="1:11" edc:when="(field &amp; 0xf) == 0xa">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_11"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_12" edc:desc="1:12" edc:when="(field &amp; 0xf) == 0xb">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_12"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_13" edc:desc="1:13" edc:when="(field &amp; 0xf) == 0xc">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_13"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_14" edc:desc="1:14" edc:when="(field &amp; 0xf) == 0xd">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_14"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_15" edc:desc="1:15" edc:when="(field &amp; 0xf) == 0xe">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_15"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0xf">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWPSA" edc:desc="WDT Prescaler A" edc:mask="0x3" edc:name="FWPSA" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="WDTPSA_1" edc:desc="1:1" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_1"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSA_8" edc:desc="1:8" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSA_64" edc:desc="1:64" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_64"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSA_512" edc:desc="1:512" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_512"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:DCRFieldDef edc:cname="WDT" edc:desc="Watchdog Timer" edc:mask="0x1" edc:name="WDT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WDT_ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDT_OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
